Revit 2027 API
EnergyAnalysisDetailModel.Tier Property
 Level of computation for energy analysis model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EnergyAnalysisDetailModelTier Tier { get; }
Public ReadOnly Property Tier As EnergyAnalysisDetailModelTier
	Get
public:
property EnergyAnalysisDetailModelTier Tier {
	EnergyAnalysisDetailModelTier get ();
}
member Tier : EnergyAnalysisDetailModelTier with get
Property Value
EnergyAnalysisDetailModelTier
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace